package com.kh.poly.pack1.dto.service;

public class 다형성 {
    /*
    다형성(多形性 - polymorphism)
        하나의 성질이 여러가지 특성으로 나타나짐

        컴파일 시간 다형성 : 메서드 오버로딩
                                - 메서드의 이름은 같지만, 매개변수의 개수나 타입이 다를 때 적용
                                - 매세드 하나에 여러가지 역할을 부여해서 과부하를 주는 것처럼 보이기 때문에 붙인 이름

        실행 시간 다혀애성 : 메서드 오버라이딩
                                - 상속 관계에서 부모 클래스의 기능을
                                  자식 클래스에서 재정의해서
                                  기능을 재설정할 때 사용





     */
}
